#+TITLE:open soft restricted data 
#+AUTHOR: Ivan Hanigan
#+email: ivan.hanigan@anu.edu.au
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LATEX: \tableofcontents
-----

** COMMENT init
#+name:init
#+begin_src R :session *shell* :tangle no :exports none :eval yes
  #### name:init ####
  projdir  <- "~/projects/opensoftware-restricteddata.github.com/report1_high_level"
  setwd(projdir)
  dir()
  
  
#+end_src

#+RESULTS: init
| A1BDRY_RainSD07.jpg    |
| A1BWET_RainSD07.jpg    |
| code                   |
| components             |
| data                   |
| Figure1.png            |
| index.org              |
| manuscript_files       |
| manuscript.pdf         |
| manuscript.Rmd         |
| manuscript.Rmd~        |
| manuscript.tex         |
| meemodified.csl        |
| opensoft.pdf           |
| opensoft_workflow.xlsx |
| references.bib         |

*** COMMENT go
#+name:go
#+begin_src R :session *R* :tangle no :exports none :eval yes
  #### name:go ####
  setwd("~/projects/opensoftware-restricteddata.github.com/report1_high_level/")
  library(rmarkdown)
  library(knitr)
  library(knitcitations)
  library(bibtex)
  cleanbib()
  #rm("bib")
  #options("cite_format"="pandoc")
  cite_options(citation_format = "pandoc", check.entries=FALSE)
  
  dir()
  render("manuscript.Rmd", "pdf_document")
  #browseURL("manuscript.pdf")
  
#+end_src

#+RESULTS: go
: /home/ivan_hanigan/projects/opensoftware-restricteddata.github.com/report1_high_level/manuscript.pdf

